#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/philward_io/philward_io/runs/run-j4RDSq7S4ei2DT7a

Waiting for the plan to start...

Terraform v1.2.8
on linux_amd64
Initializing plugins and modules...
aws_cloudfront_origin_access_identity.resume_oai: Refreshing state... [id=E1AVBUZT0CBMF6]
aws_s3_bucket.resume_bucket: Refreshing state... [id=resume.philward.io]
data.aws_iam_policy_document.resume_bucket_policy_document: Reading...
data.aws_iam_policy_document.resume_bucket_policy_document: Read complete after 0s [id=3877817331]
aws_s3_object.resume_bucket_contents["css/styles.css"]: Refreshing state... [id=css/styles.css]
aws_s3_object.resume_bucket_contents["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.resume_bucket_contents["assets/img/profile.png"]: Refreshing state... [id=assets/img/profile.png]
aws_s3_object.resume_bucket_contents["assets/img/favicon.ico"]: Refreshing state... [id=assets/img/favicon.ico]
aws_s3_object.resume_bucket_contents["js/scripts.js"]: Refreshing state... [id=js/scripts.js]
aws_s3_object.resume_bucket_contents["assets/img/favicon.png"]: Refreshing state... [id=assets/img/favicon.png]
aws_s3_bucket_policy.resume_bucket_policy: Refreshing state... [id=resume.philward.io]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "Cloudfront Distribution for Resume Site"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "ResumeS3Origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "resume.philward.io.s3.eu-north-1.amazonaws.com"
          + origin_id           = "ResumeS3Origin"

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E1AVBUZT0CBMF6"
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @phil-ward, Action: `pull_request`*